package programmers;

import java.util.Arrays;
import java.util.HashMap;
import java.util.Map;
import java.util.PriorityQueue;

//징검다리	(이분탐색, 파라메트릭 서치)	****
public class SteppingStone {
	public static void main(String[] args) {
		int[] distance = { 25, 65343245 };
		int[][] rocks = {
				{ 2, 14, 11, 21, 17 },
				{ 1229359, 14292516, 18119162, 7640178, 21475457, 13446983,
						10764311, 23677390, 16551566, 19637549, 15393700,
						13362406, 14808906, 1188568, 2430010, 995859, 6341191,
						13202229, 11128108, 21174736, 1931010, 9406546,
						17129598, 16279493, 11515655, 12283648, 18611563,
						10962958, 9331817, 19164215, 6816932, 15607344,
						18492487, 6655012, 16646986, 20600381, 22705607,
						3396266, 10239978, 14787853, 18843930, 12885894,
						21986321, 5327198, 13783223, 23728739, 1549474,
						8026301, 13229659, 8054873, 17599294, 4614842, 2902294,
						9898145, 15858474, 5860009, 21824861, 19465972,
						3521509, 15269292, 23708887, 16281697, 7936610,
						8545942, 20262894, 4297275, 12631814, 137872, 4613587,
						17270469, 18927526, 22213204, 19973483, 13639755,
						14210368, 11319843, 20736572, 10972250, 640276,
						22708998, 7109821, 9244360, 312786, 7084191, 8989726,
						5094591, 18371807, 23378634, 5074008, 718243, 12403800,
						9224735, 23212977, 3961579, 2549796, 1843642, 2242465,
						23140278, 5945922, 11818594, } };
		int[] n = { 2, 40 };
		for (int i = 0; i < distance.length; i++) {
			System.out.println(solution(distance[i], rocks[i], n[i]));
		}

	}
	//0 ~ distance사이를 이분탐색한다.
	//이분탐색으로 mid(바위를 지웠을때 최소값 중 가장 큰 값)가 정해졌을때 바위 위치를 순회하며 바위를 지우고(그리디하게) 원하는 바위 수 만큼 지웠는지 확인한다.
	//파라메트릭 서치를 하는데 있어 중요한것은 답의 범위가 연속적이며 정렬돼 있어야하고 mid가 정해졌을때 좌, 우로 가는데 판단하는 절차를 떠올리는것 같다.
	//이분탐색 문제라해서 어떻게 적용할까 생각하다 distance를 답의 범위로 잡고 풀어보려했으나 좌, 우 판단하는 절차가 떠오르지 않아 해답을 참조했다.
	static int solution(int distance, int[] rocks, int n) {
		int answer = 0;
		Arrays.sort(rocks);
		
		int start = 0, end = distance;
		while(start < end) {
			int mid = (start + end + 1) / 2;
			int remove = 0, temp = 0;	//시작은 0의 위치
			for(int i = 0; i < rocks.length; i++) {
				if(rocks[i] - temp < mid) {	//각 바위를 지워볼때 거리가 mid보다 작으면 실제로 지운다.
					remove++;
				}else {		//아니라면 그 바위를 기준점으로 두고 거리를 계산한다.
					temp = rocks[i];
				}
			}
			System.out.println(start + " " + end + " " + mid + " " + remove);
			if(remove > n) {	//지운 바위 수가 원하는 바위 수 보다 더 많으면 mid를 낮춘다.
				end = mid - 1;
			}else {
				start = mid;
			}
		}
		return answer = start;
	}
}
